ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/ADUCM36x/ADuCM362.h
/* DMASWREQ[UARTRX] - DMA UART RX */
#define DMASWREQ_UARTRX_BBA            (*(volatile unsigned long *) 0x4220028C)
#define DMASWREQ_UARTRX_MSK            (0x1   << 3  )
#define DMASWREQ_UARTRX                (0x1   << 3  )
#define DMASWREQ_UARTRX_DIS            (0x0   << 3  ) /* DIS                      */
#define DMASWREQ_UARTRX_EN             (0x1   << 3  ) /* EN                       */

/* DMASWREQ[UARTTX] - DMA UART TX */
#define DMASWREQ_UARTTX_BBA            (*(volatile unsigned long *) 0x42200288)
#define DMASWREQ_UARTTX_MSK            (0x1   << 2  )
#define DMASWREQ_UARTTX                (0x1   << 2  )
#define DMASWREQ_UARTTX_DIS            (0x0   << 2  ) /* DIS                      */
#define DMASWREQ_UARTTX_EN             (0x1   << 2  ) /* EN                       */

/* DMASWREQ[SPI1RX] - DMA SPI 1 RX */
#define DMASWREQ_SPI1RX_BBA            (*(volatile unsigned long *) 0x42200284)
#define DMASWREQ_SPI1RX_MSK            (0x1   << 1  )
#define DMASWREQ_SPI1RX                (0x1   << 1  )
#define DMASWREQ_SPI1RX_DIS            (0x0   << 1  ) /* DIS                      */
#define DMASWREQ_SPI1RX_EN             (0x1   << 1  ) /* EN                       */

/* DMASWREQ[SPI1TX] - DMA SPI 1 TX */
#define DMASWREQ_SPI1TX_BBA            (*(volatile unsigned long *) 0x42200280)
#define DMASWREQ_SPI1TX_MSK            (0x1   << 0  )
#define DMASWREQ_SPI1TX                (0x1   << 0  )
#define DMASWREQ_SPI1TX_DIS            (0x0   << 0  ) /* DIS                      */
#define DMASWREQ_SPI1TX_EN             (0x1   << 0  ) /* EN                       */

/* Reset Value for DMARMSKSET*/
#define DMARMSKSET_RVAL                0x0 
/* DMARMSKSET[UART1RX] - DMA UART1 RX */
#define DMARMSKSET_UART1RX_BBA             (*(volatile unsigned long *) 0x4220043C)
#define DMARMSKSET_UART1RX_MSK             (0x1   << 15 )
#define DMARMSKSET_UART1RX                 (0x1   << 15 )
#define DMARMSKSET_UART1RX_DIS             (0x0   << 15 ) /* DIS                      */
#define DMARMSKSET_UART1RX_EN              (0x1   << 15 ) /* EN                       */
/* DMARMSKSET[UART1TX] - DMA UART1 TX */
#define DMARMSKSET_UART1TX_BBA             (*(volatile unsigned long *) 0x42200438)
#define DMARMSKSET_UART1TX_MSK             (0x1   << 14 )
#define DMARMSKSET_UART1TX                 (0x1   << 14 )
#define DMARMSKSET_UART1TX_DIS             (0x0   << 14 ) /* DIS                      */
#define DMARMSKSET_UART1TX_EN              (0x1   << 14 ) /* EN                       */
/* DMARMSKSET[SPI0RX] - DMA SPI 0 RX */
#define DMARMSKSET_SPI0RX_BBA             (*(volatile unsigned long *) 0x42200434)
#define DMARMSKSET_SPI0RX_MSK             (0x1   << 13 )
#define DMARMSKSET_SPI0RX                 (0x1   << 13 )
#define DMARMSKSET_SPI0RX_DIS             (0x0   << 13 ) /* DIS                      */
#define DMARMSKSET_SPI0RX_EN              (0x1   << 13 ) /* EN                       */
/* DMARMSKSET[SPI0TX] - DMA SPI 0 TX */
#define DMARMSKSET_SPI0TX_BBA             (*(volatile unsigned long *) 0x42200430)
#define DMARMSKSET_SPI0TX_MSK             (0x1   << 12 )
#define DMARMSKSET_SPI0TX                 (0x1   << 12 )
#define DMARMSKSET_SPI0TX_DIS             (0x0   << 12 ) /* DIS                      */
#define DMARMSKSET_SPI0TX_EN              (0x1   << 12 ) /* EN                       */

/* DMARMSKSET[SINC2] - SINC2 Output Step detection */
#define DMARMSKSET_SINC2_BBA           (*(volatile unsigned long *) 0x4220042C)
#define DMARMSKSET_SINC2_MSK           (0x1   << 11 )
#define DMARMSKSET_SINC2               (0x1   << 11 )
#define DMARMSKSET_SINC2_DIS           (0x0   << 11 ) /* DIS                      */
#define DMARMSKSET_SINC2_EN            (0x1   << 11 ) /* EN                       */

/* DMARMSKSET[ADC1] - ADC1 */
#define DMARMSKSET_ADC1_BBA            (*(volatile unsigned long *) 0x42200428)
#define DMARMSKSET_ADC1_MSK            (0x1   << 10 )
#define DMARMSKSET_ADC1                (0x1   << 10 )
#define DMARMSKSET_ADC1_DIS            (0x0   << 10 ) /* DIS                      */
#define DMARMSKSET_ADC1_EN             (0x1   << 10 ) /* EN                       */

/* DMARMSKSET[ADC0] - ADC0 */
#define DMARMSKSET_ADC0_BBA            (*(volatile unsigned long *) 0x42200424)
#define DMARMSKSET_ADC0_MSK            (0x1   << 9  )
#define DMARMSKSET_ADC0                (0x1   << 9  )
#define DMARMSKSET_ADC0_DIS            (0x0   << 9  ) /* DIS                      */
#define DMARMSKSET_ADC0_EN             (0x1   << 9  ) /* EN                       */

/* DMARMSKSET[DAC] - DAC DMA Output */
#define DMARMSKSET_DAC_BBA             (*(volatile unsigned long *) 0x42200420)
#define DMARMSKSET_DAC_MSK             (0x1   << 8  )
#define DMARMSKSET_DAC                 (0x1   << 8  )
#define DMARMSKSET_DAC_DIS             (0x0   << 8  ) /* DIS                      */
#define DMARMSKSET_DAC_EN              (0x1   << 8  ) /* EN                       */

/* DMARMSKSET[I2CMRX] - DMA I2C Master RX */
#define DMARMSKSET_I2CMRX_BBA          (*(volatile unsigned long *) 0x4220041C)
#define DMARMSKSET_I2CMRX_MSK          (0x1   << 7  )
#define DMARMSKSET_I2CMRX              (0x1   << 7  )
#define DMARMSKSET_I2CMRX_DIS          (0x0   << 7  ) /* DIS                      */
#define DMARMSKSET_I2CMRX_EN           (0x1   << 7  ) /* EN                       */

/* DMARMSKSET[I2CMTX] - DMA I2C Master TX */
#define DMARMSKSET_I2CMTX_BBA          (*(volatile unsigned long *) 0x42200418)
#define DMARMSKSET_I2CMTX_MSK          (0x1   << 6  )
#define DMARMSKSET_I2CMTX              (0x1   << 6  )
#define DMARMSKSET_I2CMTX_DIS          (0x0   << 6  ) /* DIS                      */
#define DMARMSKSET_I2CMTX_EN           (0x1   << 6  ) /* EN                       */

/* DMARMSKSET[I2CSRX] - DMA I2C Slave RX */
#define DMARMSKSET_I2CSRX_BBA          (*(volatile unsigned long *) 0x42200414)
#define DMARMSKSET_I2CSRX_MSK          (0x1   << 5  )
#define DMARMSKSET_I2CSRX              (0x1   << 5  )
#define DMARMSKSET_I2CSRX_DIS          (0x0   << 5  ) /* DIS                      */
#define DMARMSKSET_I2CSRX_EN           (0x1   << 5  ) /* EN                       */

/* DMARMSKSET[I2CSTX] - DMA I2C Slave TX */
#define DMARMSKSET_I2CSTX_BBA          (*(volatile unsigned long *) 0x42200410)
#define DMARMSKSET_I2CSTX_MSK          (0x1   << 4  )
#define DMARMSKSET_I2CSTX              (0x1   << 4  )
#define DMARMSKSET_I2CSTX_DIS          (0x0   << 4  ) /* DIS                      */
#define DMARMSKSET_I2CSTX_EN           (0x1   << 4  ) /* EN                       */

/* DMARMSKSET[UARTRX] - DMA UART RX */
#define DMARMSKSET_UARTRX_BBA          (*(volatile unsigned long *) 0x4220040C)
#define DMARMSKSET_UARTRX_MSK          (0x1   << 3  )
#define DMARMSKSET_UARTRX              (0x1   << 3  )
#define DMARMSKSET_UARTRX_DIS          (0x0   << 3  ) /* DIS                      */
#define DMARMSKSET_UARTRX_EN           (0x1   << 3  ) /* EN                       */

/* DMARMSKSET[UARTTX] - DMA UART TX */
#define DMARMSKSET_UARTTX_BBA          (*(volatile unsigned long *) 0x42200408)
#define DMARMSKSET_UARTTX_MSK          (0x1   << 2  )
#define DMARMSKSET_UARTTX              (0x1   << 2  )
#define DMARMSKSET_UARTTX_DIS          (0x0   << 2  ) /* DIS                      */
#define DMARMSKSET_UARTTX_EN           (0x1   << 2  ) /* EN                       */

/* DMARMSKSET[SPI1RX] - DMA SPI 1 RX */
#define DMARMSKSET_SPI1RX_BBA          (*(volatile unsigned long *) 0x42200404)
#define DMARMSKSET_SPI1RX_MSK          (0x1   << 1  )
#define DMARMSKSET_SPI1RX              (0x1   << 1  )
#define DMARMSKSET_SPI1RX_DIS          (0x0   << 1  ) /* DIS                      */
#define DMARMSKSET_SPI1RX_EN           (0x1   << 1  ) /* EN                       */

/* DMARMSKSET[SPI1TX] - DMA SPI 1 TX */
#define DMARMSKSET_SPI1TX_BBA          (*(volatile unsigned long *) 0x42200400)
#define DMARMSKSET_SPI1TX_MSK          (0x1   << 0  )
#define DMARMSKSET_SPI1TX              (0x1   << 0  )
#define DMARMSKSET_SPI1TX_DIS          (0x0   << 0  ) /* DIS                      */
#define DMARMSKSET_SPI1TX_EN           (0x1   << 0  ) /* EN                       */

/* Reset Value for DMARMSKCLR*/
#define DMARMSKCLR_RVAL                0x0 

/* DMARMSKCLR[UART1RX] - DMA UART1 RX */
#define DMARMSKCLR_UART1RX_BBA             (*(volatile unsigned long *) 0x422004BC)
#define DMARMSKCLR_UART1RX_MSK             (0x1   << 15 )
#define DMARMSKCLR_UART1RX                 (0x1   << 15 )
#define DMARMSKCLR_UART1RX_DIS             (0x0   << 15 ) /* DIS                      */
#define DMARMSKCLR_UART1RX_EN              (0x1   << 15 ) /* EN                       */
/* DMARMSKCLR[UART1TX] - DMA UART1 TX */
#define DMARMSKCLR_UART1TX_BBA             (*(volatile unsigned long *) 0x422004B8)
#define DMARMSKCLR_UART1TX_MSK             (0x1   << 14 )
#define DMARMSKCLR_UART1TX                 (0x1   << 14 )
#define DMARMSKCLR_UART1TX_DIS             (0x0   << 14 ) /* DIS                      */
#define DMARMSKCLR_UART1TX_EN              (0x1   << 14 ) /* EN                       */
/* DMARMSKCLR[SPI0RX] - DMA SPI 0 RX */
#define DMARMSKCLR_SPI0RX_BBA             (*(volatile unsigned long *) 0x422004B4)
#define DMARMSKCLR_SPI0RX_MSK             (0x1   << 13 )
#define DMARMSKCLR_SPI0RX                 (0x1   << 13 )
#define DMARMSKCLR_SPI0RX_DIS             (0x0   << 13 ) /* DIS                      */
#define DMARMSKCLR_SPI0RX_EN              (0x1   << 13 ) /* EN                       */
/* DMARMSKCLR[SPI0TX] - DMA SPI 0 TX */
#define DMARMSKCLR_SPI0TX_BBA             (*(volatile unsigned long *) 0x422004B0)
#define DMARMSKCLR_SPI0TX_MSK             (0x1   << 12 )
#define DMARMSKCLR_SPI0TX                 (0x1   << 12 )
#define DMARMSKCLR_SPI0TX_DIS             (0x0   << 12 ) /* DIS                      */
#define DMARMSKCLR_SPI0TX_EN              (0x1   << 12 ) /* EN                       */
/* DMARMSKCLR[SINC2] - SINC2 Output Step detection */
#define DMARMSKCLR_SINC2_BBA           (*(volatile unsigned long *) 0x422004AC)
#define DMARMSKCLR_SINC2_MSK           (0x1   << 11 )
#define DMARMSKCLR_SINC2               (0x1   << 11 )
#define DMARMSKCLR_SINC2_DIS           (0x0   << 11 ) /* DIS                      */
#define DMARMSKCLR_SINC2_EN            (0x1   << 11 ) /* EN                       */

/* DMARMSKCLR[ADC1] - ADC1 */
#define DMARMSKCLR_ADC1_BBA            (*(volatile unsigned long *) 0x422004A8)
#define DMARMSKCLR_ADC1_MSK            (0x1   << 10 )
#define DMARMSKCLR_ADC1                (0x1   << 10 )
#define DMARMSKCLR_ADC1_DIS            (0x0   << 10 ) /* DIS                      */
#define DMARMSKCLR_ADC1_EN             (0x1   << 10 ) /* EN                       */

/* DMARMSKCLR[ADC0] - ADC0 */
#define DMARMSKCLR_ADC0_BBA            (*(volatile unsigned long *) 0x422004A4)
#define DMARMSKCLR_ADC0_MSK            (0x1   << 9  )
#define DMARMSKCLR_ADC0                (0x1   << 9  )
#define DMARMSKCLR_ADC0_DIS            (0x0   << 9  ) /* DIS                      */
#define DMARMSKCLR_ADC0_EN             (0x1   << 9  ) /* EN                       */

/* DMARMSKCLR[DAC] - DAC DMA Output */
#define DMARMSKCLR_DAC_BBA             (*(volatile unsigned long *) 0x422004A0)
#define DMARMSKCLR_DAC_MSK             (0x1   << 8  )
#define DMARMSKCLR_DAC                 (0x1   << 8  )
#define DMARMSKCLR_DAC_DIS             (0x0   << 8  ) /* DIS                      */
#define DMARMSKCLR_DAC_EN              (0x1   << 8  ) /* EN                       */

/* DMARMSKCLR[I2CMRX] - DMA I2C Master RX */
#define DMARMSKCLR_I2CMRX_BBA          (*(volatile unsigned long *) 0x4220049C)
#define DMARMSKCLR_I2CMRX_MSK          (0x1   << 7  )
#define DMARMSKCLR_I2CMRX              (0x1   << 7  )
#define DMARMSKCLR_I2CMRX_DIS          (0x0   << 7  ) /* DIS                      */
#define DMARMSKCLR_I2CMRX_EN           (0x1   << 7  ) /* EN                       */

