ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/ADUCM36x/ADuCM362.h
/* Reset Value for DMAALTCLR*/
#define DMAALTCLR_RVAL                 0x0 

/* DMAALTCLR[UART1RX] - DMA UART1 RX */
#define DMAALTCLR_UART1RX_BBA             (*(volatile unsigned long *) 0x422006BC)
#define DMAALTCLR_UART1RX_MSK             (0x1   << 15 )
#define DMAALTCLR_UART1RX                 (0x1   << 15 )
#define DMAALTCLR_UART1RX_DIS             (0x0   << 15 ) /* DIS                      */
#define DMAALTCLR_UART1RX_EN              (0x1   << 15 ) /* EN                       */
/* DMAALTCLR[UART1TX] - DMA UART1 TX */
#define DMAALTCLR_UART1TX_BBA             (*(volatile unsigned long *) 0x422006B8)
#define DMAALTCLR_UART1TX_MSK             (0x1   << 14 )
#define DMAALTCLR_UART1TX                 (0x1   << 14 )
#define DMAALTCLR_UART1TX_DIS             (0x0   << 14 ) /* DIS                      */
#define DMAALTCLR_UART1TX_EN              (0x1   << 14 ) /* EN                       */
/* DMAALTCLR[SPI0RX] - DMA SPI 0 RX */
#define DMAALTCLR_SPI0RX_BBA             (*(volatile unsigned long *) 0x422006B4)
#define DMAALTCLR_SPI0RX_MSK             (0x1   << 13 )
#define DMAALTCLR_SPI0RX                 (0x1   << 13 )
#define DMAALTCLR_SPI0RX_DIS             (0x0   << 13 ) /* DIS                      */
#define DMAALTCLR_SPI0RX_EN              (0x1   << 13 ) /* EN                       */
/* DMAALTCLR[SPI0TX] - DMA SPI 0 TX */
#define DMAALTCLR_SPI0TX_BBA             (*(volatile unsigned long *) 0x422006B0)
#define DMAALTCLR_SPI0TX_MSK             (0x1   << 12 )
#define DMAALTCLR_SPI0TX                 (0x1   << 12 )
#define DMAALTCLR_SPI0TX_DIS             (0x0   << 12 ) /* DIS                      */
#define DMAALTCLR_SPI0TX_EN              (0x1   << 12 ) /* EN                       */


/* DMAALTCLR[SINC2] - SINC2 Output Step detection */
#define DMAALTCLR_SINC2_BBA            (*(volatile unsigned long *) 0x422006AC)
#define DMAALTCLR_SINC2_MSK            (0x1   << 11 )
#define DMAALTCLR_SINC2                (0x1   << 11 )
#define DMAALTCLR_SINC2_DIS            (0x0   << 11 ) /* DIS                      */
#define DMAALTCLR_SINC2_EN             (0x1   << 11 ) /* EN                       */

/* DMAALTCLR[ADC1] - ADC1 */
#define DMAALTCLR_ADC1_BBA             (*(volatile unsigned long *) 0x422006A8)
#define DMAALTCLR_ADC1_MSK             (0x1   << 10 )
#define DMAALTCLR_ADC1                 (0x1   << 10 )
#define DMAALTCLR_ADC1_DIS             (0x0   << 10 ) /* DIS                      */
#define DMAALTCLR_ADC1_EN              (0x1   << 10 ) /* EN                       */

/* DMAALTCLR[ADC0] - ADC0 */
#define DMAALTCLR_ADC0_BBA             (*(volatile unsigned long *) 0x422006A4)
#define DMAALTCLR_ADC0_MSK             (0x1   << 9  )
#define DMAALTCLR_ADC0                 (0x1   << 9  )
#define DMAALTCLR_ADC0_DIS             (0x0   << 9  ) /* DIS                      */
#define DMAALTCLR_ADC0_EN              (0x1   << 9  ) /* EN                       */

/* DMAALTCLR[DAC] - DAC DMA Output */
#define DMAALTCLR_DAC_BBA              (*(volatile unsigned long *) 0x422006A0)
#define DMAALTCLR_DAC_MSK              (0x1   << 8  )
#define DMAALTCLR_DAC                  (0x1   << 8  )
#define DMAALTCLR_DAC_DIS              (0x0   << 8  ) /* DIS                      */
#define DMAALTCLR_DAC_EN               (0x1   << 8  ) /* EN                       */

/* DMAALTCLR[I2CMRX] - DMA I2C Master RX */
#define DMAALTCLR_I2CMRX_BBA           (*(volatile unsigned long *) 0x4220069C)
#define DMAALTCLR_I2CMRX_MSK           (0x1   << 7  )
#define DMAALTCLR_I2CMRX               (0x1   << 7  )
#define DMAALTCLR_I2CMRX_DIS           (0x0   << 7  ) /* DIS                      */
#define DMAALTCLR_I2CMRX_EN            (0x1   << 7  ) /* EN                       */

/* DMAALTCLR[I2CMTX] - DMA I2C Master TX */
#define DMAALTCLR_I2CMTX_BBA           (*(volatile unsigned long *) 0x42200698)
#define DMAALTCLR_I2CMTX_MSK           (0x1   << 6  )
#define DMAALTCLR_I2CMTX               (0x1   << 6  )
#define DMAALTCLR_I2CMTX_DIS           (0x0   << 6  ) /* DIS                      */
#define DMAALTCLR_I2CMTX_EN            (0x1   << 6  ) /* EN                       */

/* DMAALTCLR[I2CSRX] - DMA I2C Slave RX */
#define DMAALTCLR_I2CSRX_BBA           (*(volatile unsigned long *) 0x42200694)
#define DMAALTCLR_I2CSRX_MSK           (0x1   << 5  )
#define DMAALTCLR_I2CSRX               (0x1   << 5  )
#define DMAALTCLR_I2CSRX_DIS           (0x0   << 5  ) /* DIS                      */
#define DMAALTCLR_I2CSRX_EN            (0x1   << 5  ) /* EN                       */

/* DMAALTCLR[I2CSTX] - DMA I2C Slave TX */
#define DMAALTCLR_I2CSTX_BBA           (*(volatile unsigned long *) 0x42200690)
#define DMAALTCLR_I2CSTX_MSK           (0x1   << 4  )
#define DMAALTCLR_I2CSTX               (0x1   << 4  )
#define DMAALTCLR_I2CSTX_DIS           (0x0   << 4  ) /* DIS                      */
#define DMAALTCLR_I2CSTX_EN            (0x1   << 4  ) /* EN                       */

/* DMAALTCLR[UARTRX] - DMA UART RX */
#define DMAALTCLR_UARTRX_BBA           (*(volatile unsigned long *) 0x4220068C)
#define DMAALTCLR_UARTRX_MSK           (0x1   << 3  )
#define DMAALTCLR_UARTRX               (0x1   << 3  )
#define DMAALTCLR_UARTRX_DIS           (0x0   << 3  ) /* DIS                      */
#define DMAALTCLR_UARTRX_EN            (0x1   << 3  ) /* EN                       */

/* DMAALTCLR[UARTTX] - DMA UART TX */
#define DMAALTCLR_UARTTX_BBA           (*(volatile unsigned long *) 0x42200688)
#define DMAALTCLR_UARTTX_MSK           (0x1   << 2  )
#define DMAALTCLR_UARTTX               (0x1   << 2  )
#define DMAALTCLR_UARTTX_DIS           (0x0   << 2  ) /* DIS                      */
#define DMAALTCLR_UARTTX_EN            (0x1   << 2  ) /* EN                       */

/* DMAALTCLR[SPI1RX] - DMA SPI 1 RX */
#define DMAALTCLR_SPI1RX_BBA           (*(volatile unsigned long *) 0x42200684)
#define DMAALTCLR_SPI1RX_MSK           (0x1   << 1  )
#define DMAALTCLR_SPI1RX               (0x1   << 1  )
#define DMAALTCLR_SPI1RX_DIS           (0x0   << 1  ) /* DIS                      */
#define DMAALTCLR_SPI1RX_EN            (0x1   << 1  ) /* EN                       */

/* DMAALTCLR[SPI1TX] - DMA SPI 1 TX */
#define DMAALTCLR_SPI1TX_BBA           (*(volatile unsigned long *) 0x42200680)
#define DMAALTCLR_SPI1TX_MSK           (0x1   << 0  )
#define DMAALTCLR_SPI1TX               (0x1   << 0  )
#define DMAALTCLR_SPI1TX_DIS           (0x0   << 0  ) /* DIS                      */
#define DMAALTCLR_SPI1TX_EN            (0x1   << 0  ) /* EN                       */

/* Reset Value for DMAPRISET*/
#define DMAPRISET_RVAL                 0x0 
/*DMAPRISET[UART1RX] - DMA UART1 RX */
#define DMAPRISET_UART1RX_BBA             (*(volatile unsigned long *) 0x4220073C)
#define DMAPRISET_UART1RX_MSK             (0x1   << 15 )
#define DMAPRISET_UART1RX                 (0x1   << 15 )
#define DMAPRISET_UART1RX_DIS             (0x0   << 15 ) /* DIS                      */
#define DMAPRISET_UART1RX_EN              (0x1   << 15 ) /* EN                       */
/* DMAPRISET[UART1TX] - DMA UART1 TX */
#define DMAPRISET_UART1TX_BBA             (*(volatile unsigned long *) 0x42200738)
#define DMAPRISET_UART1TX_MSK             (0x1   << 14 )
#define DMAPRISET_UART1TX                 (0x1   << 14 )
#define DMAPRISET_UART1TX_DIS             (0x0   << 14 ) /* DIS                      */
#define DMAPRISET_UART1TX_EN              (0x1   << 14 ) /* EN                       */
/* DMAPRISET[SPI0RX] - DMA SPI 0 RX */
#define DMAPRISET_SPI0RX_BBA             (*(volatile unsigned long *) 0x42200734)
#define DMAPRISET_SPI0RX_MSK             (0x1   << 13 )
#define DMAPRISET_SPI0RX                 (0x1   << 13 )
#define DMAPRISET_SPI0RX_DIS             (0x0   << 13 ) /* DIS                      */
#define DMAPRISET_SPI0RX_EN              (0x1   << 13 ) /* EN                       */
/* DMAPRISET[SPI0TX] - DMA SPI 0 TX */
#define DMAPRISET_SPI0TX_BBA             (*(volatile unsigned long *) 0x42200730)
#define DMAPRISET_SPI0TX_MSK             (0x1   << 12 )
#define DMAPRISET_SPI0TX                 (0x1   << 12 )
#define DMAPRISET_SPI0TX_DIS             (0x0   << 12 ) /* DIS                      */
#define DMAPRISET_SPI0TX_EN              (0x1   << 12 ) /* EN                       */


/* DMAPRISET[SINC2] - SINC2 Output Step detection */
#define DMAPRISET_SINC2_BBA            (*(volatile unsigned long *) 0x4220072C)
#define DMAPRISET_SINC2_MSK            (0x1   << 11 )
#define DMAPRISET_SINC2                (0x1   << 11 )
#define DMAPRISET_SINC2_DIS            (0x0   << 11 ) /* DIS                      */
#define DMAPRISET_SINC2_EN             (0x1   << 11 ) /* EN                       */

