ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/ADUCM36x/ADuCM362.h
/* DMAPRISET[ADC1] - ADC1 */
#define DMAPRISET_ADC1_BBA             (*(volatile unsigned long *) 0x42200728)
#define DMAPRISET_ADC1_MSK             (0x1   << 10 )
#define DMAPRISET_ADC1                 (0x1   << 10 )
#define DMAPRISET_ADC1_DIS             (0x0   << 10 ) /* DIS                      */
#define DMAPRISET_ADC1_EN              (0x1   << 10 ) /* EN                       */

/* DMAPRISET[ADC0] - ADC0 */
#define DMAPRISET_ADC0_BBA             (*(volatile unsigned long *) 0x42200724)
#define DMAPRISET_ADC0_MSK             (0x1   << 9  )
#define DMAPRISET_ADC0                 (0x1   << 9  )
#define DMAPRISET_ADC0_DIS             (0x0   << 9  ) /* DIS                      */
#define DMAPRISET_ADC0_EN              (0x1   << 9  ) /* EN                       */

/* DMAPRISET[DAC] - DAC DMA Output */
#define DMAPRISET_DAC_BBA              (*(volatile unsigned long *) 0x42200720)
#define DMAPRISET_DAC_MSK              (0x1   << 8  )
#define DMAPRISET_DAC                  (0x1   << 8  )
#define DMAPRISET_DAC_DIS              (0x0   << 8  ) /* DIS                      */
#define DMAPRISET_DAC_EN               (0x1   << 8  ) /* EN                       */

/* DMAPRISET[I2CMRX] - DMA I2C Master RX */
#define DMAPRISET_I2CMRX_BBA           (*(volatile unsigned long *) 0x4220071C)
#define DMAPRISET_I2CMRX_MSK           (0x1   << 7  )
#define DMAPRISET_I2CMRX               (0x1   << 7  )
#define DMAPRISET_I2CMRX_DIS           (0x0   << 7  ) /* DIS                      */
#define DMAPRISET_I2CMRX_EN            (0x1   << 7  ) /* EN                       */

/* DMAPRISET[I2CMTX] - DMA I2C Master TX */
#define DMAPRISET_I2CMTX_BBA           (*(volatile unsigned long *) 0x42200718)
#define DMAPRISET_I2CMTX_MSK           (0x1   << 6  )
#define DMAPRISET_I2CMTX               (0x1   << 6  )
#define DMAPRISET_I2CMTX_DIS           (0x0   << 6  ) /* DIS                      */
#define DMAPRISET_I2CMTX_EN            (0x1   << 6  ) /* EN                       */

/* DMAPRISET[I2CSRX] - DMA I2C Slave RX */
#define DMAPRISET_I2CSRX_BBA           (*(volatile unsigned long *) 0x42200714)
#define DMAPRISET_I2CSRX_MSK           (0x1   << 5  )
#define DMAPRISET_I2CSRX               (0x1   << 5  )
#define DMAPRISET_I2CSRX_DIS           (0x0   << 5  ) /* DIS                      */
#define DMAPRISET_I2CSRX_EN            (0x1   << 5  ) /* EN                       */

/* DMAPRISET[I2CSTX] - DMA I2C Slave TX */
#define DMAPRISET_I2CSTX_BBA           (*(volatile unsigned long *) 0x42200710)
#define DMAPRISET_I2CSTX_MSK           (0x1   << 4  )
#define DMAPRISET_I2CSTX               (0x1   << 4  )
#define DMAPRISET_I2CSTX_DIS           (0x0   << 4  ) /* DIS                      */
#define DMAPRISET_I2CSTX_EN            (0x1   << 4  ) /* EN                       */

/* DMAPRISET[UARTRX] - DMA UART RX */
#define DMAPRISET_UARTRX_BBA           (*(volatile unsigned long *) 0x4220070C)
#define DMAPRISET_UARTRX_MSK           (0x1   << 3  )
#define DMAPRISET_UARTRX               (0x1   << 3  )
#define DMAPRISET_UARTRX_DIS           (0x0   << 3  ) /* DIS                      */
#define DMAPRISET_UARTRX_EN            (0x1   << 3  ) /* EN                       */

/* DMAPRISET[UARTTX] - DMA UART TX */
#define DMAPRISET_UARTTX_BBA           (*(volatile unsigned long *) 0x42200708)
#define DMAPRISET_UARTTX_MSK           (0x1   << 2  )
#define DMAPRISET_UARTTX               (0x1   << 2  )
#define DMAPRISET_UARTTX_DIS           (0x0   << 2  ) /* DIS                      */
#define DMAPRISET_UARTTX_EN            (0x1   << 2  ) /* EN                       */

/* DMAPRISET[SPI1RX] - DMA SPI 1 RX */
#define DMAPRISET_SPI1RX_BBA           (*(volatile unsigned long *) 0x42200704)
#define DMAPRISET_SPI1RX_MSK           (0x1   << 1  )
#define DMAPRISET_SPI1RX               (0x1   << 1  )
#define DMAPRISET_SPI1RX_DIS           (0x0   << 1  ) /* DIS                      */
#define DMAPRISET_SPI1RX_EN            (0x1   << 1  ) /* EN                       */

/* DMAPRISET[SPI1TX] - DMA SPI 1 TX */
#define DMAPRISET_SPI1TX_BBA           (*(volatile unsigned long *) 0x42200700)
#define DMAPRISET_SPI1TX_MSK           (0x1   << 0  )
#define DMAPRISET_SPI1TX               (0x1   << 0  )
#define DMAPRISET_SPI1TX_DIS           (0x0   << 0  ) /* DIS                      */
#define DMAPRISET_SPI1TX_EN            (0x1   << 0  ) /* EN                       */

/* Reset Value for DMAPRICLR*/
#define DMAPRICLR_RVAL                 0x0 

/*DMAPRICLR[UART1RX] - DMA UART1 RX */
#define DMAPRICLR_UART1RX_BBA             (*(volatile unsigned long *) 0x422007BC)
#define DMAPRICLR_UART1RX_MSK             (0x1   << 15 )
#define DMAPRICLR_UART1RX                 (0x1   << 15 )
#define DMAPRICLR_UART1RX_DIS             (0x0   << 15 ) /* DIS                      */
#define DMAPRICLR_UART1RX_EN              (0x1   << 15 ) /* EN                       */
/* DMAPRICLR[UART1TX] - DMA UART1 TX */
#define DMAPRICLR_UART1TX_BBA             (*(volatile unsigned long *) 0x422007B8)
#define DMAPRICLR_UART1TX_MSK             (0x1   << 14 )
#define DMAPRICLR_UART1TX                 (0x1   << 14 )
#define DMAPRICLR_UART1TX_DIS             (0x0   << 14 ) /* DIS                      */
#define DMAPRICLR_UART1TX_EN              (0x1   << 14 ) /* EN                       */
/* DMAPRICLR[SPI0RX] - DMA SPI 0 RX */
#define DMAPRICLR_SPI0RX_BBA             (*(volatile unsigned long *) 0x422007B4)
#define DMAPRICLR_SPI0RX_MSK             (0x1   << 13 )
#define DMAPRICLR_SPI0RX                 (0x1   << 13 )
#define DMAPRICLR_SPI0RX_DIS             (0x0   << 13 ) /* DIS                      */
#define DMAPRICLR_SPI0RX_EN              (0x1   << 13 ) /* EN                       */
/* DMAPRICLR[SPI0TX] - DMA SPI 0 TX */
#define DMAPRICLR_SPI0TX_BBA             (*(volatile unsigned long *) 0x422007B0)
#define DMAPRICLR_SPI0TX_MSK             (0x1   << 12 )
#define DMAPRICLR_SPI0TX                 (0x1   << 12 )
#define DMAPRICLR_SPI0TX_DIS             (0x0   << 12 ) /* DIS                      */
#define DMAPRICLR_SPI0TX_EN              (0x1   << 12 ) /* EN                       */

