ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/ADUCM36x/ADuCM362.h
/* Reset Value for ADC0MSKI*/
#define ADC0MSKI_RVAL                  0x0 

/* ADC0MSKI[ATHEX] - ADC Accumulator Comparator Threshold status bit mask */
#define ADC0MSKI_ATHEX_BBA             (*(volatile unsigned long *) 0x4260008C)
#define ADC0MSKI_ATHEX_MSK             (0x1   << 3  )
#define ADC0MSKI_ATHEX                 (0x1   << 3  )
#define ADC0MSKI_ATHEX_DIS             (0x0   << 3  ) /* DIS                      */
#define ADC0MSKI_ATHEX_EN              (0x1   << 3  ) /* EN                       */

/* ADC0MSKI[THEX] - ADC comparator threshold mask */
#define ADC0MSKI_THEX_BBA              (*(volatile unsigned long *) 0x42600088)
#define ADC0MSKI_THEX_MSK              (0x1   << 2  )
#define ADC0MSKI_THEX                  (0x1   << 2  )
#define ADC0MSKI_THEX_DIS              (0x0   << 2  ) /* DIS                      */
#define ADC0MSKI_THEX_EN               (0x1   << 2  ) /* EN                       */

/* ADC0MSKI[OVR] - ADC overrange bit mask. */
#define ADC0MSKI_OVR_BBA               (*(volatile unsigned long *) 0x42600084)
#define ADC0MSKI_OVR_MSK               (0x1   << 1  )
#define ADC0MSKI_OVR                   (0x1   << 1  )
#define ADC0MSKI_OVR_DIS               (0x0   << 1  ) /* DIS                      */
#define ADC0MSKI_OVR_EN                (0x1   << 1  ) /* EN                       */

/* ADC0MSKI[RDY] - valid conversion result mask */
#define ADC0MSKI_RDY_BBA               (*(volatile unsigned long *) 0x42600080)
#define ADC0MSKI_RDY_MSK               (0x1   << 0  )
#define ADC0MSKI_RDY                   (0x1   << 0  )
#define ADC0MSKI_RDY_DIS               (0x0   << 0  ) /* DIS                      */
#define ADC0MSKI_RDY_EN                (0x1   << 0  ) /* EN                       */

/* Reset Value for ADC0CON*/
#define ADC0CON_RVAL                   0x3038C 

/* ADC0CON[ADCEN] - Enable Bit */
#define ADC0CON_ADCEN_BBA              (*(volatile unsigned long *) 0x4260014C)
#define ADC0CON_ADCEN_MSK              (0x1   << 19 )
#define ADC0CON_ADCEN                  (0x1   << 19 )
#define ADC0CON_ADCEN_DIS              (0x0   << 19 ) /* DIS                      */
#define ADC0CON_ADCEN_EN               (0x1   << 19 ) /* EN                       */

/* ADC0CON[ADCCODE] - ADC Output Coding bits */
#define ADC0CON_ADCCODE_BBA            (*(volatile unsigned long *) 0x42600148)
#define ADC0CON_ADCCODE_MSK            (0x1   << 18 )
#define ADC0CON_ADCCODE                (0x1   << 18 )
#define ADC0CON_ADCCODE_INT            (0x0   << 18 ) /* INT                      */
#define ADC0CON_ADCCODE_UINT           (0x1   << 18 ) /* UINT                     */

/* ADC0CON[BUFPOWN] - Negative buffer power down */
#define ADC0CON_BUFPOWN_BBA            (*(volatile unsigned long *) 0x42600144)
#define ADC0CON_BUFPOWN_MSK            (0x1   << 17 )
#define ADC0CON_BUFPOWN                (0x1   << 17 )
#define ADC0CON_BUFPOWN_DIS            (0x0   << 17 ) /* Disable powerdown - Negative buffer is enabled */
#define ADC0CON_BUFPOWN_EN             (0x1   << 17 ) /* Enable powerdown - Negative buffer is disabled */

/* ADC0CON[BUFPOWP] - Positive buffer power down */
#define ADC0CON_BUFPOWP_BBA            (*(volatile unsigned long *) 0x42600140)
#define ADC0CON_BUFPOWP_MSK            (0x1   << 16 )
#define ADC0CON_BUFPOWP                (0x1   << 16 )
#define ADC0CON_BUFPOWP_DIS            (0x0   << 16 ) /* Disable powerdown - Positive buffer is enabled */
#define ADC0CON_BUFPOWP_EN             (0x1   << 16 ) /* Enable powerdown - Positive buffer is disabled */

/* ADC0CON[BUFBYPP] - Positive buffer bypass */
#define ADC0CON_BUFBYPP_BBA            (*(volatile unsigned long *) 0x4260013C)
#define ADC0CON_BUFBYPP_MSK            (0x1   << 15 )
#define ADC0CON_BUFBYPP                (0x1   << 15 )
#define ADC0CON_BUFBYPP_DIS            (0x0   << 15 ) /* DIS                      */
#define ADC0CON_BUFBYPP_EN             (0x1   << 15 ) /* EN                       */

/* ADC0CON[BUFBYPN] - Negative buffer bypass */
#define ADC0CON_BUFBYPN_BBA            (*(volatile unsigned long *) 0x42600138)
#define ADC0CON_BUFBYPN_MSK            (0x1   << 14 )
#define ADC0CON_BUFBYPN                (0x1   << 14 )
#define ADC0CON_BUFBYPN_DIS            (0x0   << 14 ) /* DIS                      */
#define ADC0CON_BUFBYPN_EN             (0x1   << 14 ) /* EN                       */

/* ADC0CON[ADCREF] - Reference selection */
#define ADC0CON_ADCREF_MSK             (0x3   << 12 )
#define ADC0CON_ADCREF_INTREF          (0x0   << 12 ) /* INTREF                   */
#define ADC0CON_ADCREF_EXTREF          (0x1   << 12 ) /* EXTREF                   */
#define ADC0CON_ADCREF_EXTREF2         (0x2   << 12 ) /* EXTREF2                  */
#define ADC0CON_ADCREF_AVDDREF         (0x3   << 12 ) /* AVDDREF                  */

/* ADC0CON[ADCDIAG] - Diagnostic Current bits bits */
#define ADC0CON_ADCDIAG_MSK            (0x3   << 10 )
#define ADC0CON_ADCDIAG_DIAG_OFF       (0x0   << 10 ) /* DIAG_OFF                 */
#define ADC0CON_ADCDIAG_DIAG_POS       (0x1   << 10 ) /* DIAG_POS                 */
#define ADC0CON_ADCDIAG_DIAG_NEG       (0x2   << 10 ) /* DIAG_NEG                 */
#define ADC0CON_ADCDIAG_DIAG_ALL       (0x3   << 10 ) /* DIAG_ALL                 */

/* ADC0CON[ADCCP] - AIN+ bits */
#define ADC0CON_ADCCP_MSK              (0x1F  << 5  )
#define ADC0CON_ADCCP_AIN0             (0x0   << 5  ) /* AIN0                     */
#define ADC0CON_ADCCP_AIN1             (0x1   << 5  ) /* AIN1                     */
#define ADC0CON_ADCCP_AIN2             (0x2   << 5  ) /* AIN2                     */
#define ADC0CON_ADCCP_AIN3             (0x3   << 5  ) /* AIN3                     */
#define ADC0CON_ADCCP_AIN4             (0x4   << 5  ) /* AIN4                     */
#define ADC0CON_ADCCP_AIN5             (0x5   << 5  ) /* AIN5                     */
#define ADC0CON_ADCCP_AIN6             (0x6   << 5  ) /* AIN6                     */
#define ADC0CON_ADCCP_AIN7             (0x7   << 5  ) /* AIN7                     */
#define ADC0CON_ADCCP_AIN8             (0x8   << 5  ) /* AIN8                     */
#define ADC0CON_ADCCP_AIN9             (0x9   << 5  ) /* AIN9                     */
#define ADC0CON_ADCCP_AIN10            (0xA   << 5  ) /* AIN10                    */
#define ADC0CON_ADCCP_AIN11            (0xB   << 5  ) /* AIN11                    */
#define ADC0CON_ADCCP_DAC              (0xC   << 5  ) /* DAC                      */
#define ADC0CON_ADCCP_AVDD4            (0xD   << 5  ) /* AVDD4                    */
#define ADC0CON_ADCCP_IOVDD4           (0xE   << 5  ) /* IOVDD4                   */
#define ADC0CON_ADCCP_AGND             (0xF   << 5  ) /* AGND                     */
#define ADC0CON_ADCCP_TEMP             (0x10  << 5  ) /* TEMP                     */

/* ADC0CON[ADCCN] - AIN- bits */
#define ADC0CON_ADCCN_MSK              (0x1F  << 0  )
#define ADC0CON_ADCCN_AIN0             (0x0   << 0  ) /* AIN0                     */
#define ADC0CON_ADCCN_AIN1             (0x1   << 0  ) /* AIN1                     */
#define ADC0CON_ADCCN_AIN2             (0x2   << 0  ) /* AIN2                     */
#define ADC0CON_ADCCN_AIN3             (0x3   << 0  ) /* AIN3                     */
#define ADC0CON_ADCCN_AIN4             (0x4   << 0  ) /* AIN4                     */
#define ADC0CON_ADCCN_AIN5             (0x5   << 0  ) /* AIN5                     */
#define ADC0CON_ADCCN_AIN6             (0x6   << 0  ) /* AIN6                     */
#define ADC0CON_ADCCN_AIN7             (0x7   << 0  ) /* AIN7                     */
#define ADC0CON_ADCCN_AIN8             (0x8   << 0  ) /* AIN8                     */
#define ADC0CON_ADCCN_AIN9             (0x9   << 0  ) /* AIN9                     */
#define ADC0CON_ADCCN_AIN10            (0xA   << 0  ) /* AIN10                    */
#define ADC0CON_ADCCN_AIN11            (0xB   << 0  ) /* AIN11                    */
#define ADC0CON_ADCCN_DAC              (0xC   << 0  ) /* DAC                      */
#define ADC0CON_ADCCN_AGND             (0xF   << 0  ) /* AGND                     */
#define ADC0CON_ADCCN_TEMP             (0x11  << 0  ) /* TEMP                     */

/* Reset Value for ADC0OF*/
#define ADC0OF_RVAL                    0x0 

/* ADC0OF[VALUE] - Offset */
#define ADC0OF_VALUE_MSK               (0xFFFF << 0  )

/* Reset Value for ADC0INTGN*/
#define ADC0INTGN_RVAL                 0x5555 

/* ADC0INTGN[VALUE] - Gain with Int Ref */
#define ADC0INTGN_VALUE_MSK            (0xFFFF << 0  )

/* Reset Value for ADC0EXTGN*/
#define ADC0EXTGN_RVAL                 0x5555 

/* ADC0EXTGN[VALUE] - Gain with Ext Ref */
#define ADC0EXTGN_VALUE_MSK            (0xFFFF << 0  )

/* Reset Value for ADC0VDDGN*/
#define ADC0VDDGN_RVAL                 0x5555 

/* ADC0VDDGN[VALUE] - Gain with Avdd Ref */
#define ADC0VDDGN_VALUE_MSK            (0xFFFF << 0  )

/* Reset Value for ADCCFG*/
#define ADCCFG_RVAL                    0xF 

/* ADCCFG[SIMU] - Enable both ADCs */
#define ADCCFG_SIMU_BBA                (*(volatile unsigned long *) 0x426003BC)
#define ADCCFG_SIMU_MSK                (0x1   << 15 )
#define ADCCFG_SIMU                    (0x1   << 15 )
#define ADCCFG_SIMU_DIS                (0x0   << 15 ) /* DIS                      */
#define ADCCFG_SIMU_EN                 (0x1   << 15 ) /* EN                       */

/* ADCCFG[BOOST30] - Boost the Vbias current source ability by 30 times */
#define ADCCFG_BOOST30_BBA             (*(volatile unsigned long *) 0x426003B4)
#define ADCCFG_BOOST30_MSK             (0x1   << 13 )
#define ADCCFG_BOOST30                 (0x1   << 13 )
#define ADCCFG_BOOST30_DIS             (0x0   << 13 ) /* DIS                      */
#define ADCCFG_BOOST30_EN              (0x1   << 13 ) /* EN                       */

/* ADCCFG[PINSEL] - Enable vbias generator, send vbias to selected ain pin bits */
#define ADCCFG_PINSEL_MSK              (0x7   << 8  )
#define ADCCFG_PINSEL_DIS              (0x0   << 8  ) /* Disable VBIAS generator  */
#define ADCCFG_PINSEL_AIN7             (0x4   << 8  ) /* AIN7                     */
#define ADCCFG_PINSEL_AIN11            (0x6   << 8  ) /* AIN11                    */

/* ADCCFG[GNDSWON] - GND_SW */
#define ADCCFG_GNDSWON_BBA             (*(volatile unsigned long *) 0x4260039C)
#define ADCCFG_GNDSWON_MSK             (0x1   << 7  )
#define ADCCFG_GNDSWON                 (0x1   << 7  )
#define ADCCFG_GNDSWON_DIS             (0x0   << 7  ) /* DIS                      */
#define ADCCFG_GNDSWON_EN              (0x1   << 7  ) /* EN                       */

