ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ADI/ADUCM36x/ADuCM362.h
/* Reset Value for ADC0PRO*/
#define ADC0PRO_RVAL                   0x0 

/* ADC0PRO[ACCEN] - ADC Accumulator Enable bits */
#define ADC0PRO_ACCEN_MSK              (0x3   << 4  )
#define ADC0PRO_ACCEN_Off              (0x0   << 4  ) /* Off                      */
#define ADC0PRO_ACCEN_En               (0x1   << 4  ) /* En                       */
#define ADC0PRO_ACCEN_EnNDec           (0x2   << 4  ) /* EnNDec                   */
#define ADC0PRO_ACCEN_EnAccCnt         (0x3   << 4  ) /* EnAccCnt                 */

/* ADC0PRO[CMPEN] - ADC Comparator Enable bits */
#define ADC0PRO_CMPEN_MSK              (0x3   << 2  )
#define ADC0PRO_CMPEN_Off              (0x0   << 2  ) /* Off                      */
#define ADC0PRO_CMPEN_En               (0x1   << 2  ) /* En                       */
#define ADC0PRO_CMPEN_EnCnt            (0x2   << 2  ) /* EnCnt                    */
#define ADC0PRO_CMPEN_EnCntDec         (0x3   << 2  ) /* EnCntDec                 */

/* ADC0PRO[OREN] - ADC OverRange Enable */
#define ADC0PRO_OREN_BBA               (*(volatile unsigned long *) 0x42600884)
#define ADC0PRO_OREN_MSK               (0x1   << 1  )
#define ADC0PRO_OREN                   (0x1   << 1  )
#define ADC0PRO_OREN_DIS               (0x0   << 1  ) /* DIS                      */
#define ADC0PRO_OREN_EN                (0x1   << 1  ) /* EN                       */

/* ADC0PRO[RCEN] - ADC Result Counter Enable */
#define ADC0PRO_RCEN_BBA               (*(volatile unsigned long *) 0x42600880)
#define ADC0PRO_RCEN_MSK               (0x1   << 0  )
#define ADC0PRO_RCEN                   (0x1   << 0  )
#define ADC0PRO_RCEN_DIS               (0x0   << 0  ) /* DIS                      */
#define ADC0PRO_RCEN_EN                (0x1   << 0  ) /* EN                       */

/* Reset Value for ADC0DAT*/
#define ADC0DAT_RVAL                   0x0 

/* ADC0DAT[VALUE] -  */
#define ADC0DAT_VALUE_MSK              (0xFFFFFFFF << 0  )
#if (__NO_MMR_STRUCTS__==1)

#define          ADC1STA                                    (*(volatile unsigned char      *) 0x40030080)
#define          ADC1MSKI                                   (*(volatile unsigned char      *) 0x40030084)
#define          ADC1CON                                    (*(volatile unsigned long      *) 0x40030088)
#define          ADC1OF                                     (*(volatile unsigned short int *) 0x4003008C)
#define          ADC1INTGN                                  (*(volatile unsigned short int *) 0x40030090)
#define          ADC1EXTGN                                  (*(volatile unsigned short int *) 0x40030094)
#define          ADC1VDDGN                                  (*(volatile unsigned short int *) 0x40030098)
#define          ADCSCFG1                                   (*(volatile unsigned short int *) 0x4003009C)
#define          ADC1FLT                                    (*(volatile unsigned short int *) 0x400300A0)
#define          ADC1MDE                                    (*(volatile unsigned short int *) 0x400300A4)
#define          ADC1RCR                                    (*(volatile unsigned short int *) 0x400300A8)
#define          ADC1RCV                                    (*(volatile unsigned short int *) 0x400300AC)
#define          ADC1TH                                     (*(volatile unsigned short int *) 0x400300B0)
#define          ADC1THC                                    (*(volatile unsigned char      *) 0x400300B4)
#define          ADC1THV                                    (*(volatile unsigned char      *) 0x400300B8)
#define          ADC1ACC                                    (*(volatile unsigned long      *) 0x400300BC)
#define          ADC1ATH                                    (*(volatile unsigned long      *) 0x400300C0)
#define          ADC1PRO                                    (*(volatile unsigned char      *) 0x400300C4)
#define          ADC1DAT                                    (*(volatile unsigned long      *) 0x400300C8)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for ADC1STA*/
#define ADC1STA_RVAL                   0x0 

/* ADC1STA[CAL] - ADC Calibration status register */
#define ADC1STA_CAL_BBA                (*(volatile unsigned long *) 0x42601014)
#define ADC1STA_CAL_MSK                (0x1   << 5  )
#define ADC1STA_CAL                    (0x1   << 5  )
#define ADC1STA_CAL_DIS                (0x0   << 5  ) /* DIS                      */
#define ADC1STA_CAL_EN                 (0x1   << 5  ) /* EN                       */

/* ADC1STA[ERR] - ADC conversion error status bit. */
#define ADC1STA_ERR_BBA                (*(volatile unsigned long *) 0x42601010)
#define ADC1STA_ERR_MSK                (0x1   << 4  )
#define ADC1STA_ERR                    (0x1   << 4  )
#define ADC1STA_ERR_DIS                (0x0   << 4  ) /* DIS                      */
#define ADC1STA_ERR_EN                 (0x1   << 4  ) /* EN                       */

/* ADC1STA[ATHEX] - ADC Accumulator Comparator Threshold status bit. */
#define ADC1STA_ATHEX_BBA              (*(volatile unsigned long *) 0x4260100C)
#define ADC1STA_ATHEX_MSK              (0x1   << 3  )
#define ADC1STA_ATHEX                  (0x1   << 3  )
#define ADC1STA_ATHEX_DIS              (0x0   << 3  ) /* DIS                      */
#define ADC1STA_ATHEX_EN               (0x1   << 3  ) /* EN                       */

/* ADC1STA[THEX] - ADC comparator threshold. */
#define ADC1STA_THEX_BBA               (*(volatile unsigned long *) 0x42601008)
#define ADC1STA_THEX_MSK               (0x1   << 2  )
#define ADC1STA_THEX                   (0x1   << 2  )
#define ADC1STA_THEX_DIS               (0x0   << 2  ) /* DIS                      */
#define ADC1STA_THEX_EN                (0x1   << 2  ) /* EN                       */

/* ADC1STA[OVR] - ADC overrange bit. */
#define ADC1STA_OVR_BBA                (*(volatile unsigned long *) 0x42601004)
#define ADC1STA_OVR_MSK                (0x1   << 1  )
#define ADC1STA_OVR                    (0x1   << 1  )
#define ADC1STA_OVR_DIS                (0x0   << 1  ) /* DIS                      */
#define ADC1STA_OVR_EN                 (0x1   << 1  ) /* EN                       */

/* ADC1STA[RDY] - valid conversion result */
#define ADC1STA_RDY_BBA                (*(volatile unsigned long *) 0x42601000)
#define ADC1STA_RDY_MSK                (0x1   << 0  )
#define ADC1STA_RDY                    (0x1   << 0  )
#define ADC1STA_RDY_DIS                (0x0   << 0  ) /* DIS                      */
#define ADC1STA_RDY_EN                 (0x1   << 0  ) /* EN                       */

